ZeitZeitZeit/openloop_pwm_syscfg/epwm_sync_svm.syscfg
epwm5.$name                                                    = "myEPWM5";
epwm5.copyUse                                                  = true;
epwm5.copyFrom                                                 = "myEPWM1";
epwm5.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm5.epwmTimebase_period                                      = 1999;
epwm5.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm5.epwmTimebase_syncOutPulseMode                            = "EPWM_SYNC_OUT_PULSE_ON_COUNTER_ZERO";
epwm5.epwmCounterCompare_cmpA                                  = 1000;
epwm5.epwmCounterCompare_cmpB                                  = 500;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode          = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_TOGGLE";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_TOGGLE";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode          = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_TOGGLE";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_TOGGLE";
epwm5.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm5.epwmDeadband_enableRED                                   = true;
epwm5.epwmDeadband_enableFED                                   = true;
epwm5.epwmTimebase_phaseEnable                                 = false;
epwm5.epwmDeadband_delayRED                                    = 480;
epwm5.epwmDeadband_delayFED                                    = 480;
epwm5.epwm.$assign                                             = "EPWM5";
epwm5.epwm.epwm_aPin.$assign                                   = "GPIO8";
epwm5.epwm.epwm_bPin.$assign                                   = "GPIO9";

epwm6.$name                                                    = "myEPWM3";
epwm6.copyUse                                                  = true;
epwm6.copyFrom                                                 = "myEPWM1";
epwm6.epwm.epwm_aPin.$assign                                   = "GPIO4";
epwm6.epwm.epwm_bPin.$assign                                   = "GPIO5";
epwm6.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm6.epwmTimebase_period                                      = 1999;
epwm6.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm6.epwmTimebase_syncOutPulseMode                            = "EPWM_SYNC_OUT_PULSE_ON_COUNTER_ZERO";
epwm6.epwmCounterCompare_cmpA                                  = 1000;
epwm6.epwmCounterCompare_cmpB                                  = 500;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode          = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_TOGGLE";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_TOGGLE";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode          = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_TOGGLE";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_TOGGLE";
epwm6.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm6.epwmDeadband_enableRED                                   = true;
epwm6.epwmDeadband_enableFED                                   = true;
epwm6.epwmTimebase_phaseEnable                                 = false;
epwm6.epwmDeadband_delayRED                                    = 480;
epwm6.epwmDeadband_delayFED                                    = 480;
epwm6.epwm.$assign                                             = "EPWM3";

inputxbar1.$name = "myINPUTXBAR5";

inputxbar_input1.$name          = "myINPUTXBARINPUT0";
inputxbar_input1.inputxbarInput = "XBAR_INPUT5";
inputxbar_input1.inputxbarGpio  = "GPIO56";

inputxbar_input2.$name          = "myINPUTXBARINPUT1";
inputxbar_input2.inputxbarInput = "XBAR_INPUT6";
inputxbar_input2.inputxbarGpio  = "GPIO56";

signalsight1.$name                                            = "myMCUSignalSight0";
signalsight1.bufferSize                                       = 50;
signalsight1.exporter.comsLinkModule.loopback                 = scripting.forceWrite(false);
signalsight1.exporter.comsLinkModule.wordLenght               = scripting.forceWrite("8");
signalsight1.exporter.comsLinkModule.stop                     = scripting.forceWrite("ONE");
signalsight1.exporter.comsLinkModule.parity                   = scripting.forceWrite("SCI_CONFIG_PAR_NONE");
signalsight1.exporter.comsLinkModule.useFifo                  = scripting.forceWrite(true);
signalsight1.exporter.comsLinkModule.txFifo                   = scripting.forceWrite("SCI_FIFO_TX0");
signalsight1.exporter.comsLinkModule.useCase                  = scripting.forceWrite("ALL");
signalsight1.exporter.comsLinkModule.sci.$assign              = "SCIA";
signalsight1.exporter.comsLinkModule.sci.sci_rxPin.$assign    = "GPIO28";
signalsight1.exporter.comsLinkModule.sci.sci_txPin.$assign    = "GPIO29";
signalsight1.exporter.comsLinkModule.rxQual.$name             = "myGPIOQUAL0";
signalsight1.exporter.comsLinkModule.txQual.$name             = "myGPIOQUAL1";
signalsight1.exporter.comsLinkModule.sciTXInt.enableInterrupt = scripting.forceWrite(false);
signalsight1.hash.$name                                       = "myHashTable0";
signalsight1.hash.hashElements.create(9);
signalsight1.hash.hashElements[0].$name                       = "sopwm_m";
signalsight1.hash.hashElements[1].$name                       = "sopwm_theta";
signalsight1.hash.hashElements[2].$name                       = "sopwm_angle1";
signalsight1.hash.hashElements[3].$name                       = "sopwm_angle2";
signalsight1.hash.hashElements[4].$name                       = "sopwm_angle3";
signalsight1.hash.hashElements[5].$name                       = "sopwm_angle4";
signalsight1.hash.hashElements[6].$name                       = "sopwm_angle5";
signalsight1.hash.hashElements[7].$name                       = "sopwm_angle6";
signalsight1.hash.hashElements[8].$name                       = "sopwm_angle7";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.epwm.$suggestSolution           = "EPWM1";
epwm4.epwm.epwm_aPin.$suggestSolution = "GPIO10";
epwm4.epwm.epwm_bPin.$suggestSolution = "GPIO11";
epwm6.epwm.epwm_aPin.$suggestSolution = "GPIO4";
epwm6.epwm.epwm_bPin.$suggestSolution = "GPIO5";
